[
{"title": "FAST-SG: An alignment-free algorithm for hybrid assembly", "authors": ["Alex Di Genova", "Gonzalo A. Ruz", "Marie-France Sagot", "Alejandro Maass"], "doi": " https://doi.org/10.1101/209122 ", "abstract": "Long read sequencing technologies are the ultimate solution for genome repeats, allowing near reference level reconstructions of large genomes. However, long read de novo assembly pipelines are computationally intense and require a considerable amount of coverage, thereby hindering their broad application to the assembly of large genomes. Alternatively, hybrid assembly methods which combine short and long read sequencing technologies can reduce the time and cost required to produce de novo assemblies of large genomes. In this paper, we propose a new method, called FAST-SG, which uses a new ultra-fast alignment- free algorithm specifically designed for constructing a scaffolding graph using light-weight data structures. FAST-SG can construct the graph from either short or long reads. This allows the reuse of efficient algorithms designed for short read data and permits the definition of novel modular hybrid assembly pipelines. Using comprehensive standard datasets and benchmarks, we show how FAST-SG outperforms the state-of-the-art short read aligners when building the scaffolding graph, and can be used to extract linking information from either raw or error-corrected long reads. We also show how a hybrid assembly approach using FAST-SG with shallow long read coverage (5X) and moderate computational resources can produce long-range and accurate reconstructions of the genomes of Arabidopsis thaliana (Ler-0) and human (NA12878).", "link": "https://www.biorxiv.org/content/early/2017/10/26/209122.full.pdf", "date": "Posted October 26, 2017."},
{"title": "Getting in shape and swimming: the role of cortical forces and membrane heterogeneity in eukaryotic cells", "authors": ["Hao Wu", "Marco Avila Ponce de Leon", "Hans Othmer"], "doi": " https://doi.org/10.1101/198523 ", "abstract": "Recent research has shown that motile cells can adapt their mode of propulsion to the mechanical properties of the environment in which they find themselves -- crawling in some environments while swimming in others. The latter can involve movement by blebbing or other cyclic shape changes, and both highly-simplified and more realistic models of these modes have been studied previously. Herein we study swimming that is driven by membrane tension gradients that arise from flows in the actin cortex underlying the membrane, and does not involve imposed cyclic shape changes. Such gradients can lead to a number of different characteristic cell shapes, and our first objective is to understand how different distributions of membrane tension influence the shape of cells in a quiescent fluid. We then analyze the effects of spatial variation in other membrane properties, and how they interact with tension gradients to determine the shape. We also study the effect of fluid-cell interactions and show how tension leads to cell movement, how the balance between tension gradients and a variable bending modulus determine the shape and direction of movement, and how the efficiency of movement depends on the properties of the fluid and the distribution of tension and bending modulus in the membrane.", "link": "https://www.biorxiv.org/content/early/2017/10/26/198523.full.pdf", "date": "Posted October 26, 2017."},
{"title": "Structural robustness of mammalian transcription factor networks reveals plasticity across development", "authors": ["Jose Luis Caldu-Primo", "Elena Rocio Alvarez-Buylla", "Jose Davila-Velderrain"], "doi": " https://doi.org/10.1101/209528 ", "abstract": "Network biology aims to understand cell behavior through the analysis of underlying complex biomolecular networks. Inference of condition-specific interaction networks from epigenomic data enables the characterization of the structural plasticity that regulatory networks can acquire in different tissues of the same organism. From this perspective, uncovering specific patterns of variation by comparing network structure among tissues could provide insights into systems-level mechanisms underlying cell behavior. Following this idea, here we propose an empirical framework to analyze mammalian tissue-specific networks, focusing on characterizing and contrasting their structure and behavior in response to perturbations. We structurally represent the state of the cell/tissue by condition specific transcription factor networks generated using chromatin accessibility data, and we profile their systems behavior in terms of the structural robustness against random and directed perturbations. Using this framework, we unveil the structural heterogeneity existing among tissues at different levels of differentiation. We uncover a novel and conserved systems property of regulatory networks underlying embryonic stem cells (ESCs): in contrast to terminally differentiated tissues, the promiscuous regulatory connectivity of ESCs produces a globally homogeneous network resulting in increased structural robustness. Possible biological consequences of this property are discussed.", "link": "https://www.biorxiv.org/content/early/2017/10/26/209528.full.pdf", "date": "Posted October 26, 2017."},
{"title": "Nanopore Sequencing Reveals High-Resolution Structural Variation in the Cancer Genome", "authors": ["Liang Gong", "Chee-Hong Wong", "Wei-Chung Cheng", "Harianto Tjong", "Francesca Menghi", "Chew Yee Ngan", "Edison T. Liu", "Chia-Lin Wei"], "doi": " https://doi.org/10.1101/209718 ", "abstract": "Acquired genomic structural variants (SVs) are major hallmarks of the cancer genome. Their complexity has been challenging to reconstruct from short-read sequencing data. Here, we exploit the long-read sequencing capability of the nanopore platform using our customized pipeline, Picky, to reveal SVs of diverse architecture in a breast cancer model. From modest sequencing coverage, we identified the full spectrum of SVs with superior specificity and sensitivity relative to short-read analyses and uncovered repetitive DNA as the major source of variation. Examination of the genome-wide breakpoints at nucleotide-resolution uncovered micro-insertions as the common structural features associated with SVs. Breakpoint density across the genome is associated with propensity for inter-chromosomal connectivity and transcriptional regulation. Furthermore, an over-representation of reciprocal translocations from chromosomal double-crossovers was observed through phased SVs. The comprehensive characterization of SVs using the robust long-read sequencing approach in cancer cohorts will facilitate strategies to monitor genome stability during tumor evolution and improve therapeutic intervention.", "link": "https://www.biorxiv.org/content/early/2017/10/26/209718.full.pdf", "date": "Posted October 26, 2017."},
{"title": "Pathway-based polygenic risk implicates GO: 17144 drug metabolism in recurrent depressive disorder", "authors": ["Anna Docherty", "Arden Moscati", "T. Bernard Bigdeli", "Alexis K. Edwards", "Roseann Peterson", "Fuzhong Yang", "Daniel E. Adkins", "John S. Anderson", "Jonathan Flint", "Kenneth S. Kendler", "Silviu-Alin Bacanu"], "doi": " https://doi.org/10.1101/209544 ", "abstract": "The Psychiatric Genomics Consortium (PGC) has made major advances in the molecular etiology of MDD, confirming that MDD is highly polygenic, with any top risk loci conferring a very small proportion of variance in case-control status. Pathway enrichment results from PGC meta-analyses can also be used to help inform molecular drug targets. Prior to any knowledge of molecular biomarkers for MDD, drugs targeting molecular pathways have proved successful in treating MDD. However, it is possible that with information from PGC analyses, examining specific molecular pathway(s) implicated in MDD can further inform our study of molecular drug targets. Using a large case-control GWAS based on low-coverage whole genome sequencing (N = 10,640), we derived polygenic risk scores for MDD and for MDD specific to each of over 300 molecular pathways. We then used these data to identify sets of scores significantly predictive of case status, accounting for critical covariates. Over and above global polygenic risk for MDD, polygenic risk within the GO: 17144 drug metabolism pathway significantly predicted recurrent depression. In transcriptomic analyses, two pathway genes yielded suggestive signals at FDR q-values = .054: CYP2C19 (family of Cytochrome P450) and CBR1 (Carbonyl Reductase 1). Because the neuroleptic carbamazepine is a known inducer of CYP2C19, future research might examine whether drug metabolism PRS has any influence on clinical presentation and treatment response. Overall, results indicate that pathway-based risk might inform treatment of severe depression. We discuss limitations to the generalizability of these preliminary findings, and urge replication in future research.", "link": "https://www.biorxiv.org/content/early/2017/10/26/209544.full.pdf", "date": "Posted October 26, 2017."},
{"title": "Synthesizing Signaling Pathways from Temporal Phosphoproteomic Data", "authors": ["Ali Sinan Köksal", "Kirsten Beck", "Dylan R. Cronin", "Aaron McKenna", "Nathan D. Camp", "Saurabh Srivastava", "Matthew E. MacGilvray", "Rastislav Bodík", "Alejandro Wolf-Yadlin", "Ernest Fraenkel", "Jasmin Fisher", "Anthony Gitter"], "doi": " https://doi.org/10.1101/209676 ", "abstract": "Advances in proteomics reveal that pathway databases fail to capture the majority of cellular signaling activity. Our mass spectrometry study of the dynamic epidermal growth factor (EGF) response demonstrates that over 89% of significantly (de)phosphorylated proteins are excluded from individual EGF signaling maps, and 63% are absent from all annotated pathways. We present a computational method, the Temporal Pathway Synthesizer (TPS), to discover missing pathway elements by modeling temporal phosphoproteomic data. TPS uses constraint solving to exhaustively explore all possible structures for a signaling pathway, eliminating structures that are inconsistent with protein-protein interactions or the observed phosphorylation event timing. Applied to our EGF response data, TPS connects 83% of the responding proteins to receptors and signaling proteins in EGF pathway maps. Inhibiting predicted active kinases supports the TPS pathway model. The TPS algorithm is broadly applicable and also recovers an accurate model of the yeast osmotic stress response.", "link": "https://www.biorxiv.org/content/early/2017/10/26/209676.full.pdf", "date": "Posted October 26, 2017."},
{"title": "Discovery and Evaluation of Biosynthetic Pathways for the Production of Five Methyl Ethyl Ketone Precursors", "authors": ["Milenko Tokic", "Noushin Hadadi", "Meric Ataman", "Dario S. Neves", "Birgitta E. Ebert", "Lars M. Blank", "Ljubisa Miskovic", "Vassily Hatzimanikatis"], "doi": " https://doi.org/10.1101/209569 ", "abstract": "The limited supply of fossil fuels and the establishment of new environmental policies shifted research in industry and academia towards sustainable production of the 2nd generation of biofuels, with Methyl Ethyl Ketone (MEK) being one promising fuel candidate. MEK is a commercially valuable petrochemical with an extensive application as a solvent. However, as of today, a sustainable and economically viable production of MEK has not yet been achieved despite several attempts of introducing biosynthetic pathways in industrial microorganisms. We used BNICE.ch to discover all novel pathways around MEK. Out of 1325 identified compounds connecting to MEK with one reaction step, we selected 3-oxopentanoate, but-3-en-2-one, but-1-en-2-olate, butylamine, and 2-hydroxy-2-methyl-butanenitrile for further study. We reconstructed 3679610 novel biosynthetic pathways towards these 5 compounds. We then embedded these pathways into the genome-scale model of E. coli, retaining a set of 18925 most biologically viable ones based on their thermodynamic feasibilities and yields. For each novel reaction in the viable pathways, we proposed the most similar KEGG reactions, with their gene and protein sequences, as candidates for either a direct experimental implementation or as basis for enzyme engineering. Through pathway similarity analysis we classified the pathways and identified the enzymes and precursors that were indispensable for the production of the target molecules. The developments from this study enhance the potential of BNICE.ch for discovery, systematic evaluation, and analysis of novel pathways in future synthetic biology and metabolic engineering studies.", "link": "https://www.biorxiv.org/content/early/2017/10/26/209569.full.pdf", "date": "Posted October 26, 2017."},
{"title": "Cantu syndrome-associated SUR2 (ABCC9) mutations in distinct structural domains result in KATP channel gain-of-function by differential mechanisms", "authors": ["Conor McClenaghan", "Alex Hanson", "Monica Sala-Rabanal", "Helen I Roessler", "Dragana Josifova", "Dorothy K Grange", "Gijs van Haaften", "Colin G Nichols"], "doi": " https://doi.org/10.1101/209783 ", "abstract": "The complex cardiovascular disorder Cantu Syndrome arises from gain-of-function mutations in either KCNJ8 or ABCC9, the genes encoding the Kir6.1 and SUR2 subunits of ATP-sensitive potassium (KATP) channels. Recent reports indicate that such mutations can increase channel activity by multiple molecular mechanisms. In this study, we determine the mechanism by which KATP function is altered by several mutations in distinct structural domains of SUR2: D207E in the intracellular L0-linker and Y985S, G989E, M1060I, and R1154Q/W in TMD2. Mutations were engineered at their equivalent position in rat SUR2A (D207E, Y981S, G985E, M1056I and R1150Q/W) and functional effects were investigated using macroscopic rubidium (86Rb+) efflux assays and patch clamp electrophysiology. The results show that D207E increases KATP  activity by increasing intrinsic stability of the open state, whilst the cluster of Y981S/G985E/M1056I  mutations, as well as R1150Q/W, augment Mg-nucleotide activation. The response of mutant channels to inhibition by the sulfonylurea drug glibenclamide, a potential pharmacotherapy for CS, was also tested. There was no major effect on glibenclamide sensitivity for the D207E, Y981S, G985E or M1056I mutations, but glutamine and tryptophan substitution at R1150 resulted in significant decreases in potency.", "link": "https://www.biorxiv.org/content/early/2017/10/26/209783.full.pdf", "date": "Posted October 26, 2017."},
{"title": "Genomics and telemetry suggest a role for migration harshness in determining overwintering habitat choice, but not gene flow, in anadromous Arctic Char", "authors": ["Jean-Sebastien Moore", "Les N. Harris", "Jérémy Le Luyer", "Ben J. G. Sutherland", "Quentin Rougemont", "Ross F. Tallman", "Aaron T. Fisk", "Louis Bernatchez"], "doi": " https://doi.org/10.1101/138545 ", "abstract": "Migration is a ubiquitous life history trait with profound evolutionary and ecological consequences. Recent developments in telemetry and genomics, when combined, can bring significant insights on the migratory ecology of non-model organisms in the wild. Here, we used this integrative approach to document dispersal, gene flow and potential for local adaptation in anadromous Arctic Char from six rivers in the Canadian Arctic. Acoustic telemetry data from 124 tracked individuals indicated asymmetric dispersal, with a large proportion of fish (72%) tagged in three different rivers migrating up the same short river in the fall. Population genomics data from 6,136 SNP markers revealed weak, albeit significant, population differentiation (average pairwise FST = 0.011) and asymmetric dispersal was also revealed by population assignments. Approximate Bayesian Computation simulations suggested the presence of asymmetric gene flow, although in the opposite direction to that observed from the telemetry data, suggesting that dispersal does not necessarily lead to gene flow. These observations suggested that Arctic Char home to their natal river to spawn, but may overwinter in rivers with the shortest migratory route to minimize the costs of migration in non-breeding years. Genome scans and genetic-environment associations identified 90 outlier markers putatively under selection, 23 of which were in or near a gene. Of these, at least four were involved in muscle and cardiac function, consistent with the hypothesis that migratory harshness could drive local adaptation. Our study illustrates the power of integrating genomics and telemetry to study migrations in non-model organisms in logistically challenging environments such as the Arctic.", "link": "https://www.biorxiv.org/content/early/2017/10/26/138545.full.pdf", "date": "Posted October 26, 2017."},
{"title": "Mapping the ecological networks of microbial communities", "authors": ["Yandong Xiao", "Marco Tulio Angulo", "Jonathan Friedman", "Matthew K. Waldor", "Scott T. Weiss", "Yang-Yu Liu"], "doi": " https://doi.org/10.1101/150649 ", "abstract": "Microbes form complex and dynamic ecosystems that play key roles in the health of the animals and plants with which they are associated. Such ecosystems are often represented by a directed, signed and weighted ecological network, where nodes represent microbial taxa and edges represent ecological interactions. Inferring the underlying ecological networks of microbial communities is a necessary step towards understanding their assembly rules and predicting their dynamical response to external stimuli. However, current methods for inferring such networks require assuming a particular population dynamics model, which is typically not known a priori. Moreover, those methods require fitting longitudinal abundance data, which is not readily available, and often does not contain the variation that is necessary for reliable inference. To overcome these limitations, here we develop a new method to map the ecological networks of microbial communities using steady-state data. Our method can qualitatively infer the inter-taxa interaction types or signs (positive, negative or neutral) without assuming any particular population dynamics model. Additionally, when the population dynamics is assumed to follow the classic Generalized Lotka-Volterra model, our method can quantitatively infer the inter-taxa interaction strengths and intrinsic growth rates. We systematically validate our method using simulated data, and then apply it to four experimental datasets of microbial communities. Our method offers a novel framework to infer microbial interactions and reconstruct ecological networks, and represents a key step towards reliable modeling of complex, real-world microbial communities, such as the human gut microbiota.", "link": "https://www.biorxiv.org/content/early/2017/10/26/150649.full.pdf", "date": "Posted October 26, 2017."}
]